artillery.fire.yml
config:
  target: "http://localhost:4000"

  phases:
    - duration: 300
      arrivalRate: 1
      rampTo: 10
      name: Sustained load

before:
  flow:
    - post:
        url: "/login"
        json:
          login: "admin"
          password: "admin"
        capture:
          json: "$.token"
          as: "token"
        expect:
          - statusCode: 201

scenarios:
  - flow:
    - post:
        url: "/users"
        json:
          name: "James Doe"
          login: "james@hotmail.com"
          password: "P@ssw0rd"
        headers:
          Authorization: "Bearer {{ token }}"
        capture:
          json: "$.id"
          as: "id"
    - get:
        url: "/users/{{ id }}"
        headers:
          Authorization: "Bearer {{ token }}"
    - delete:
        url: "/users/{{ id }}"
        headers:
          Authorization: "Bearer {{ token }}"