load.testing.yml
config:
  target: "http://localhost:4000/"

phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 20
      name: test1

before:
  flow:
    - log: "Get auth token"
    - post:
        url: "/login"
        json:
          login: "admin"
          password: "admin"
        capture:
          - json: $.token
            as: token

scenarios:
  - flow:
    - get:
        url: "/users"
        headers:
          authorization: "Bearer {{ token }}"

after:
  flow:
    -log: "test finished"